grevaillot/svd_tools/headers/ATSAMA5D35/memorymap.h
#pragma once 

#define SMD_BASE			(0x00400000)
#define AXIMX_BASE			(0x00800000)
#define HSMCI0_BASE			(0xf0000000)
#define SPI0_BASE			(0xf0004000)
#define SSC0_BASE			(0xf0008000)
#define CAN0_BASE			(0xf000c000)
#define TC0_BASE			(0xf0010000)
#define TWI0_BASE			(0xf0014000)
#define TWI1_BASE			(0xf0018000)
#define USART0_BASE			(0xf001c000)
#define USART1_BASE			(0xf0020000)
#define UART0_BASE			(0xf0024000)
#define GMAC_BASE			(0xf0028000)
#define PWM_BASE			(0xf002c000)
#define ISI_BASE			(0xf0034000)
#define SFR_BASE			(0xf0038000)
#define HSMCI1_BASE			(0xf8000000)
#define HSMCI2_BASE			(0xf8004000)
#define SPI1_BASE			(0xf8008000)
#define SSC1_BASE			(0xf800c000)
#define CAN1_BASE			(0xf8010000)
#define TC1_BASE			(0xf8014000)
#define ADC_BASE			(0xf8018000)
#define TWI2_BASE			(0xf801c000)
#define USART2_BASE			(0xf8020000)
#define USART3_BASE			(0xf8024000)
#define UART1_BASE			(0xf8028000)
#define EMAC_BASE			(0xf802c000)
#define UDPHS_BASE			(0xf8030000)
#define TRNG_BASE			(0xf8040000)
#define FUSE_BASE			(0xffffe400)
#define DMAC0_BASE			(0xffffe600)
#define DMAC1_BASE			(0xffffe800)
#define MPDDRC_BASE			(0xffffea00)
#define MATRIX_BASE			(0xffffec00)
#define DBGU_BASE			(0xffffee00)
#define AIC_BASE			(0xfffff000)
#define PIOA_BASE			(0xfffff200)
#define PIOB_BASE			(0xfffff400)
#define PIOC_BASE			(0xfffff600)
#define PIOD_BASE			(0xfffff800)
#define PIOE_BASE			(0xfffffa00)
#define PMC_BASE			(0xfffffc00)
#define RSTC_BASE			(0xfffffe00)
#define SHDWC_BASE			(0xfffffe10)
#define PIT_BASE			(0xfffffe30)
#define WDT_BASE			(0xfffffe40)
#define SCKC_BASE			(0xfffffe50)
#define BSC_BASE			(0xfffffe54)
#define GPBR_BASE			(0xfffffe60)
#define RTC_BASE			(0xfffffeb0)
